20240919191230-portfolio_5.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-09-29 Sun 23:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Portfolio 5</title>
<meta name="author" content="chameko" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="imagine.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Portfolio 5</h1>
<p>
One of the things I mentioned in my self reflection is that I have problems with both open ended research and keeping to a plan due to my procrastination. Despite my best efforts I have let both get the better of me.
</p>

<p>
I am way behind the plan I initially put down and have failed to make meaningful progress in my research. Reflecting back on the plan, I think that I needed to refine and discuss it more with my supervisor when I created it. While it provided a general overview its very easy to become discouraged when the goals listed as so large and that then leads to me procrastinating it. Instead I should have broken it down into smaller, more achievable chunks to keep better track of progress and encourage more productive work.
</p>

<p>
My communication has also decreases as when reduced to e-mail it became too easy to forget/procrastinate which lead to a compounding problem where I haven't contacted my supervisor in a long time and am avoiding reaching out because I don't know how he'll react.
</p>

<p>
However, as disappointed as I am in past me I can only change the future. I've stated in my self reflection that I'm adaptable and that is what I must do right now. I'm creating a new plan with more broken down, easier to achieve goals and have restarted work on the project. You always have more time than you think, it just requires you to make sacrifices. I also plan to re-establish communication with my supervisor because will need the assistance he can provide.
</p>
</div>
<div id="postamble" class="status">
<p class="author">Author: chameko</p>
<p class="date">Created: 2024-09-29 Sun 23:33</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
